In [79]:
import pandas as pd

In [80]:
df=pd.read_csv('Names.csv',header=None)

## Set columns header

In [81]:
df.columns=['First','Last','Address','City','State','Area Code','Income']

In [82]:
print(df[['City','State']])

          City State
0    Riverside    NJ
1        Phila    PA
2    Riverside    NJ
3     SomeTown    SD
4     SomeTown    SD
5  Desert City    CO

## Print Only 0 to 5 columns

In [83]:
print(df[['City','State']][0:5])

        City State
0  Riverside    NJ
1      Phila    PA
2  Riverside    NJ
3   SomeTown    SD
4   SomeTown    SD

## Printing whole row

In [84]:
print(df.iloc[1])

First                Jack
Last             McGinnis
Address      220 hobo Av.
City                Phila
State                  PA
Area Code            9119
Income              18000
Name: 1, dtype: object

## Print specific row+column value

In [85]:
print(df.iloc[2,1])
# columns and row both start with index 0

Repici

## Create new dataFrame with required values

In [86]:
wanted_values=df[['First','Last','City']]

In [87]:
wanted_values

                 First      Last         City
0                 John       Doe    Riverside
1                 Jack  McGinnis        Phila
2        John "Da Man"    Repici    Riverside
3              Stephen     Tyler     SomeTown
4                  NaN  Blankman     SomeTown
5  Joan "Danger", Anne       Jet  Desert City

## Save to new Excel

In [88]:
# from openpyxl.workbook import Workbook

In [89]:
# stored=wanted_values.to_excel('State_Location.xlxs',index=None)

In [90]:
df

,First,Last,Address,City,State,Area Code,Income
0,John,Doe,120 jefferson st.,Riverside,NJ,8074,45000
1,Jack,McGinnis,220 hobo Av.,Phila,PA,9119,18000
2,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075,120000
3,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234,90000
4,NaN,Blankman,NaN,SomeTown,SD,298,30000
5,"Joan ""Danger"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123,68000

## Get all people living at Riverside

In [91]:
print( df.loc[  (df['City']=='Riverside') & (df['First']=='John')   ] )

  First Last            Address       City State  Area Code  Income
0  John  Doe  120 jefferson st.  Riverside    NJ       8074   45000

## Adding tax column

In [92]:
df['Tax % ']=df['Income'].apply(lambda x: .15 if 10000 < x < 40000 else .2 if 40000 < x < 80000 else .25)

In [93]:
df['Taxes Owned']= df['Income'] * df['Tax % ']

In [94]:
print(df['Taxes Owned'])

0     9000.0
1     2700.0
2    30000.0
3    22500.0
4     4500.0
5    13600.0
Name: Taxes Owned, dtype: float64

## Dropping columns

In [95]:
to_drop=['First','Address','Area Code']

In [96]:
df.drop(columns=to_drop,inplace=True)

In [97]:
print(df)

       Last         City State  Income  Tax %   Taxes Owned
0       Doe    Riverside    NJ   45000    0.20       9000.0
1  McGinnis        Phila    PA   18000    0.15       2700.0
2    Repici    Riverside    NJ  120000    0.25      30000.0
3     Tyler     SomeTown    SD   90000    0.25      22500.0
4  Blankman     SomeTown    SD   30000    0.15       4500.0
5       Jet  Desert City    CO   68000    0.20      13600.0

## Update value of new column based on condition on another columns

In [98]:
df['Test Col']=False
df.loc[df['Income']<60000,'Test Col']=True
print(df)

       Last         City State  Income  Tax %   Taxes Owned  Test Col
0       Doe    Riverside    NJ   45000    0.20       9000.0      True
1  McGinnis        Phila    PA   18000    0.15       2700.0      True
2    Repici    Riverside    NJ  120000    0.25      30000.0     False
3     Tyler     SomeTown    SD   90000    0.25      22500.0     False
4  Blankman     SomeTown    SD   30000    0.15       4500.0      True
5       Jet  Desert City    CO   68000    0.20      13600.0     False

## GroupBy and Sort

In [131]:
print(df.groupby(['Test Col']).mean().sort_values('Income'))

KeyError: 'Test Col'

##

In [132]:
import numpy as np

In [133]:
df=pd.read_csv('Names.csv',header=None)
df.columns=['First','Last','Address','City','State','Area Code','Income']

In [134]:
df.drop(columns='Address',inplace=True)

In [135]:
df.set_index('Area Code',inplace=True)

In [136]:
print(df.loc[8074])

First          John
Last            Doe
City      Riverside
State            NJ
Income        45000
Name: 8074, dtype: object

In [137]:
print(df.iloc[0])

First          John
Last            Doe
City      Riverside
State            NJ
Income        45000
Name: 8074, dtype: object

In [138]:
print(df.loc[8074:,'First'])

Area Code
8074                    John
9119                    Jack
8075           John "Da Man"
91234                Stephen
298                      NaN
123      Joan "Danger", Anne
Name: First, dtype: object

In [139]:
print(df.loc[8074:,'First'])

Area Code
8074                    John
9119                    Jack
8075           John "Da Man"
91234                Stephen
298                      NaN
123      Joan "Danger", Anne
Name: First, dtype: object

In [144]:
df.First.str.split(expand=True)

                 0          1     2
Area Code
8074          John       None  None
9119          Jack       None  None
8075          John        "Da  Man"
91234      Stephen       None  None
298            NaN        NaN   NaN
123           Joan  "Danger",  Anne

                 0          1     2
Area Code
8074          John       None  None
9119          Jack       None  None
8075          John        "Da  Man"
91234      Stephen       None  None
298            NaN        NaN   NaN
123           Joan  "Danger",  Anne